reports/artillery/artillery_with_console.log
Phase started: unnamed (index: 0, duration: 1s) 18:13:30(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 18:13:31(-0300)

--------------------------------------
Metrics for period to: 18:13:40(-0300) (width: 3.897s)
--------------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 258/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 497
  median: ...................................................................... 133
  p95: ......................................................................... 242.3
  p99: ......................................................................... 368.8
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 354.3
  max: ......................................................................... 3157.8
  median: ...................................................................... 2951.9
  p95: ......................................................................... 3134.5
  p99: ......................................................................... 3134.5


All VUs finished. Total time: 5 seconds

--------------------------------
Summary report @ 18:13:34(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 129/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 497
  median: ...................................................................... 133
  p95: ......................................................................... 242.3
  p99: ......................................................................... 368.8
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 354.3
  max: ......................................................................... 3157.8
  median: ...................................................................... 2951.9
  p95: ......................................................................... 3134.5
  p99: ......................................................................... 3134.5