reports/artillery/artillery_without_console.log
Phase started: unnamed (index: 0, duration: 1s) 18:12:08(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 18:12:09(-0300)

--------------------------------------
Metrics for period to: 18:12:20(-0300) (width: 1.819s)
--------------------------------------

http.codes.200: ................................................................ 702
http.request_rate: ............................................................. 363/sec
http.requests: ................................................................. 658
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 414
  median: ...................................................................... 82.3
  p95: ......................................................................... 194.4
  p99: ......................................................................... 295.9
http.responses: ................................................................ 702
vusers.completed: .............................................................. 44
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1245.1
  max: ......................................................................... 2189.5
  median: ...................................................................... 2018.7
  p95: ......................................................................... 2101.1
  p99: ......................................................................... 2186.8


--------------------------------------
Metrics for period to: 18:12:10(-0300) (width: 1.093s)
--------------------------------------

http.codes.200: ................................................................ 298
http.request_rate: ............................................................. 318/sec
http.requests: ................................................................. 342
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 363
  median: ...................................................................... 57.4
  p95: ......................................................................... 169
  p99: ......................................................................... 308
http.responses: ................................................................ 298
vusers.completed: .............................................................. 6
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 300.4
  max: ......................................................................... 978.4
  median: ...................................................................... 468.8
  p95: ......................................................................... 925.4
  p99: ......................................................................... 925.4


All VUs finished. Total time: 4 seconds

--------------------------------
Summary report @ 18:12:11(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 171/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 414
  median: ...................................................................... 76
  p95: ......................................................................... 190.6
  p99: ......................................................................... 301.9
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 300.4
  max: ......................................................................... 2189.5
  median: ...................................................................... 1939.5
  p95: ......................................................................... 2101.1
  p99: ......................................................................... 2186.8